Repository: 4lequinn/solotodo_core
Catalog: entity_subscriptions/locale/*/LC_MESSAGES/django.po
Languages: es

source: Pricing change
es: Cambio de pricing

source: Pricing change notification
es: Notificacion de cambio de pricing

source: One of your subscriptions has just changed its pricing
es: Una de sus suscripciones acaba de cambiar de precio

source: Store
es: Tienda

source: Name
es: Nombre

source: Reference price
es: Precio de referencia

source: Date
es: Fecha

source: Old registry
es: Registro anterior

source: Is available
es: Disponibilidad

source: Yes,No
es: SÃ­,No

source: Normal price
es: Precio normal

source: Offer price
es: Precio oferta

source: New registry
es: Nuevo registro

source: Check price history
es: Ver historial de precio
